eboxmaker/eBox_Framework/mcuLib/N32G030/CMSIS/device/n32g030.h
#define RCC_APB1PRST_WWDGRST    ((uint32_t)0x00000800) /*!< Window Watchdog reset */
#define RCC_APB1PRST_USART2RST  ((uint32_t)0x00020000) /*!< USART 2 reset */
#define RCC_APB1PRST_LPUARTRST  ((uint32_t)0x00040000) /*!< Low Power UART reset */
#define RCC_APB1PRST_I2C1RST    ((uint32_t)0x00200000) /*!< I2C 1 reset */
#define RCC_APB1PRST_I2C2RST    ((uint32_t)0x00400000) /*!< I2C 2 reset */
#define RCC_APB1PRST_PWRRST     ((uint32_t)0x10000000) /*!< Power interface reset */

/******************  Bit definition for RCC_AHBPCLKEN register  ******************/
#define RCC_AHBPCLKEN_DMAEN    ((uint32_t)0x00000001) /*!< DMA clock enable */
#define RCC_AHBPCLKEN_SRAMEN   ((uint32_t)0x00000004) /*!< SRAM interface clock enable */
#define RCC_AHBPCLKEN_FLITFEN  ((uint32_t)0x00000010) /*!< FLITF clock enable */
#define RCC_AHBPCLKEN_HSQRTEN  ((uint32_t)0x00000020) /*!< Hsqrt clock enable */
#define RCC_AHBPCLKEN_CRCEN    ((uint32_t)0x00000040) /*!< CRC clock enable */
#define RCC_AHBPCLKEN_HDIVEN   ((uint32_t)0x00000080) /*!< Hdiv clock enable */
#define RCC_AHBPCLKEN_ADCEN    ((uint32_t)0x00001000) /*!< ADC clock enable */

/******************  Bit definition for RCC_APB2PCLKEN register  *****************/
#define RCC_APB2PCLKEN_AFIOEN   ((uint32_t)0x00000001) /*!< Alternate Function I/O clock enable */
#define RCC_APB2PCLKEN_IOPAEN   ((uint32_t)0x00000004) /*!< I/O port A clock enable */
#define RCC_APB2PCLKEN_IOPBEN   ((uint32_t)0x00000008) /*!< I/O port B clock enable */
#define RCC_APB2PCLKEN_IOPCEN   ((uint32_t)0x00000010) /*!< I/O port C clock enable */
#define RCC_APB2PCLKEN_IOPFEN   ((uint32_t)0x00000080) /*!< I/O port F clock enable */
#define RCC_APB2PCLKEN_SPI1EN   ((uint32_t)0x00000200) /*!< SPI1 clock enable */
#define RCC_APB2PCLKEN_SPI2EN   ((uint32_t)0x00000400) /*!< SPI2 clock enable */
#define RCC_APB2PCLKEN_TIM1EN   ((uint32_t)0x00001000) /*!< TIM1 Timer clock enable */
#define RCC_APB2PCLKEN_TIM8EN   ((uint32_t)0x00002000) /*!< TIM8 Timer clock enable */
#define RCC_APB2PCLKEN_USART1EN ((uint32_t)0x00004000) /*!< USART1 clock enable */

/*****************  Bit definition for RCC_APB1PCLKEN register  ******************/
#define RCC_APB1PCLKEN_TIM3EN     ((uint32_t)0x00000002) /*!< Timer 3 clock enable */
#define RCC_APB1PCLKEN_LPTIMPCLKEN ((uint32_t)0x00000004) /*!< Low Power Timer PCLK clock enable */
#define RCC_APB1PCLKEN_LPTIMEN    ((uint32_t)0x00000008) /*!< Low Power Timer clock enable */
#define RCC_APB1PCLKEN_TIM6EN     ((uint32_t)0x00000010) /*!< Timer 6 clock enable */
#define RCC_APB1PCLKEN_BEEPEN     ((uint32_t)0x00000020) /*!< Beeper clock enable */
#define RCC_APB1PCLKEN_COMPEN     ((uint32_t)0x00000100) /*!< COMP clock enable */
#define RCC_APB1PCLKEN_COMPFILTEN ((uint32_t)0x00000200) /*!< COMP Filter clock enable */
#define RCC_APB1PCLKEN_WWDGEN     ((uint32_t)0x00000800) /*!< Window Watchdog clock enable */
#define RCC_APB1PCLKEN_USART2EN   ((uint32_t)0x00020000) /*!< USART 2 clock enable */
#define RCC_APB1PCLKEN_LPUARTEN   ((uint32_t)0x00040000) /*!< LPUART clock enable */
#define RCC_APB1PCLKEN_I2C1EN     ((uint32_t)0x00200000) /*!< I2C 1 clock enable */
#define RCC_APB1PCLKEN_I2C2EN     ((uint32_t)0x00400000) /*!< I2C 2 clock enable */
#define RCC_APB1PCLKEN_PWREN      ((uint32_t)0x10000000) /*!< Power interface clock enable */
#define RCC_APB1PCLKEN_OPAMPEN    ((uint32_t)0x80000000) /*!< OPAMP interface clock enable */

/*******************  Bit definition for RCC_LSCTRL register  *******************/
#define RCC_LSCTRL_LSIEN ((uint32_t)0x00000001) /*!< Internal Low Speed oscillator enable */
#define RCC_LSCTRL_LSIRD ((uint32_t)0x00000002) /*!< Internal Low Speed oscillator Ready */
#define RCC_LSCTRL_LSEEN ((uint32_t)0x00000004) /*!< External Low Speed oscillator enable */
#define RCC_LSCTRL_LSERD ((uint32_t)0x00000008) /*!< External Low Speed oscillator Ready */
#define RCC_LSCTRL_LSEBP ((uint32_t)0x00000010) /*!< External Low Speed oscillator Bypass */

#define RCC_LSCTRL_RTCSEL   ((uint32_t)0x00000060) /*!< RTCSEL[1:0] bits (RTC clock source selection) */
#define RCC_LSCTRL_RTCSEL_0 ((uint32_t)0x00000020) /*!< Bit 0 */
#define RCC_LSCTRL_RTCSEL_1 ((uint32_t)0x00000040) /*!< Bit 1 */

/*!< RTC congiguration */
#define RCC_LSCTRL_RTCSEL_NOCLOCK    ((uint32_t)0x00000000) /*!< No clock */
#define RCC_LSCTRL_RTCSEL_LSE        ((uint32_t)0x00000020) /*!< LSE oscillator clock used as RTC clock */
#define RCC_LSCTRL_RTCSEL_LSI        ((uint32_t)0x00000040) /*!< LSI oscillator clock used as RTC clock */
#define RCC_LSCTRL_RTCSEL_HSE_DIV128 ((uint32_t)0x00000060) /*!< HSE oscillator clock divided by 128 used as RTC clock */

#define RCC_LSCTRL_RTCEN          ((uint32_t)0x00000080) /*!< RTC clock enable */
#define RCC_LSCTRL_RTCRST         ((uint32_t)0x00000100) /*!< RTC software reset  */

#define RCC_LSCTRL_LPRUNCLKSEL    ((uint32_t)0x00000200) /*!< LowPower Run Mode clock selection */
#define RCC_LSCTRL_LPRUNCLK_LSI   ((uint32_t)0x00000000) /*!< LSI oscillator clock used as LowPower Run Mode clock */
#define RCC_LSCTRL_LPRUNCLK_LSE   ((uint32_t)0x00000200) /*!< LSE oscillator clock used as LowPower Run Mode clock */

/*******************  Bit definition for RCC_CTRLSTS register  ********************/
#define RCC_CTRLSTS_RMRSTF     ((uint32_t)0x00000001) /*!< Remove reset flag */
#define RCC_CTRLSTS_RAMRSTF    ((uint32_t)0x00000002) /*!< RAM reset flag */
#define RCC_CTRLSTS_MMURSTF    ((uint32_t)0x00000004) /*!< MMU reset flag */
#define RCC_CTRLSTS_PINRSTF    ((uint32_t)0x00000008) /*!< PIN reset flag */
#define RCC_CTRLSTS_PORRSTF    ((uint32_t)0x00000010) /*!< POR reset flag */
#define RCC_CTRLSTS_SFTRSTF    ((uint32_t)0x00000020) /*!< Software Reset flag */
#define RCC_CTRLSTS_IWDGRSTF   ((uint32_t)0x00000040) /*!< Independent Watchdog reset flag */
#define RCC_CTRLSTS_WWDGRSTF   ((uint32_t)0x00000080) /*!< Window watchdog reset flag */
#define RCC_CTRLSTS_LPWRRSTF   ((uint32_t)0x00000100) /*!< Low-Power reset flag */
#define RCC_CTRLSTS_EMCGBNRSTF ((uint32_t)0x00000200) /*!< EMCGBN reset flag */
#define RCC_CTRLSTS_EMCGBRSTF  ((uint32_t)0x00000400) /*!< EMCGB reset flag */
#define RCC_CTRLSTS_EMCCLPRSTF ((uint32_t)0x00000800) /*!< EMCCLP reset flag */

/*******************  Bit definition for RCC_AHBPRST register  ****************/
#define RCC_AHBRST_HSQRTRST  ((uint32_t)0x00000020) /*!< HSQRT reset */
#define RCC_AHBRST_HDIVRST   ((uint32_t)0x00000080) /*!< HDIV reset */
#define RCC_AHBRST_ADCRST    ((uint32_t)0x00001000) /*!< ADC reset */

