eboxmaker/eBox_Framework/mcuLib/N32G030/CMSIS/device/n32g030.h
/*!< LPUART configuration */
#define RCC_CFG2_LPUARTSEL   ((uint32_t)0x0E000000) /*!< LPUARTSEL[2:0] bits */
#define RCC_CFG2_LPUARTSEL_0 ((uint32_t)0x02000000) /*!< Bit 0 */
#define RCC_CFG2_LPUARTSEL_1 ((uint32_t)0x04000000) /*!< Bit 1 */
#define RCC_CFG2_LPUARTSEL_2 ((uint32_t)0x08000000) /*!< Bit 2 */

#define RCC_CFG2_LPUARTSEL_APB1   ((uint32_t)0x00000000) /*!< APB1 clock used as LPUART clock */
#define RCC_CFG2_LPUARTSEL_SYSCLK ((uint32_t)0x02000000) /*!< System Clock used as LPUART clock */
#define RCC_CFG2_LPUARTSEL_HSI    ((uint32_t)0x04000000) /*!< HSI oscillator clock used as LPUART clock */
#define RCC_CFG2_LPUARTSEL_HSE    ((uint32_t)0x06000000) /*!< HSE oscillator clock used as LPUART clock */
#define RCC_CFG2_LPUARTSEL_LSI    ((uint32_t)0x08000000) /*!< LSI oscillator clock used as LPUART clock */
#define RCC_CFG2_LPUARTSEL_LSE    ((uint32_t)0x0A000000) /*!< LSE oscillator clock used as LPUART clock */

/*!< TIMCLK_SEL configuration */
#define RCC_CFG2_TIMCLKSEL ((uint32_t)0x20000000) /*!< Timer1/8 clock source select */

#define RCC_CFG2_TIMCLKSEL_TIM18CLK ((uint32_t)0x00000000) /*!< Timer1/8 clock selected as tim1/8_clk input clock */
#define RCC_CFG2_TIMCLKSEL_SYSCLK   ((uint32_t)0x20000000) /*!< Timer1/8 clock selected as sysclk input clock */

/*******************  Bit definition for RCC_EMCCTRL register  ******************/
#define RCC_EMCCTRL_CLPDET0EN ((uint32_t)0x00000001) /*!< CLP0 Detect Enable */
#define RCC_EMCCTRL_CLPDET1EN ((uint32_t)0x00000002) /*!< CLP1 Detect Enable */
#define RCC_EMCCTRL_CLPDET2EN ((uint32_t)0x00000004) /*!< CLP2 Detect Enable */
#define RCC_EMCCTRL_CLPDET3EN ((uint32_t)0x00000008) /*!< CLP3 Detect Enable */
#define RCC_EMCCTRL_GBNDET0EN ((uint32_t)0x00000010) /*!< GBN0 Detect Enable */
#define RCC_EMCCTRL_GBNDET1EN ((uint32_t)0x00000020) /*!< GBN1 Detect Enable */
#define RCC_EMCCTRL_GBNDET2EN ((uint32_t)0x00000040) /*!< GBN2 Detect Enable */
#define RCC_EMCCTRL_GBNDET3EN ((uint32_t)0x00000080) /*!< GBN3 Detect Enable */
#define RCC_EMCCTRL_GBDET0EN  ((uint32_t)0x00000100) /*!< GB0 Detect Enable */
#define RCC_EMCCTRL_GBDET1EN  ((uint32_t)0x00000200) /*!< GB1 Detect Enable */
#define RCC_EMCCTRL_GBDET2EN  ((uint32_t)0x00000400) /*!< GB2 Detect Enable */
#define RCC_EMCCTRL_GBDET3EN  ((uint32_t)0x00000800) /*!< GB3 Detect Enable */
#define RCC_EMCCTRL_CLP0RST   ((uint32_t)0x00001000) /*!< CLP0 Reset */
#define RCC_EMCCTRL_CLP1RST   ((uint32_t)0x00002000) /*!< CLP1 Reset */
#define RCC_EMCCTRL_CLP2RST   ((uint32_t)0x00004000) /*!< CLP2 Reset */
#define RCC_EMCCTRL_CLP3RST   ((uint32_t)0x00008000) /*!< CLP3 Reset */
#define RCC_EMCCTRL_GBN0RST   ((uint32_t)0x00010000) /*!< GBN0 Reset */
#define RCC_EMCCTRL_GBN1RST   ((uint32_t)0x00020000) /*!< GBN1 Reset */
#define RCC_EMCCTRL_GBN2RST   ((uint32_t)0x00040000) /*!< GBN2 Reset */
#define RCC_EMCCTRL_GBN3RST   ((uint32_t)0x00080000) /*!< GBN3 Reset */
#define RCC_EMCCTRL_GB0RST    ((uint32_t)0x00010000) /*!< GB0 Reset */
#define RCC_EMCCTRL_GB1RST    ((uint32_t)0x00020000) /*!< GB1 Reset */
#define RCC_EMCCTRL_GB2RST    ((uint32_t)0x00040000) /*!< GB2 Reset */
#define RCC_EMCCTRL_GB3RST    ((uint32_t)0x00080000) /*!< GB3 Reset */

/******************************************************************************/
/*                                                                            */
/*                               SystemTick                                   */
/*                                                                            */
/******************************************************************************/

/*****************  Bit definition for SysTick_CTRL register  *****************/
#define SysTick_CTRL_ENABLE    ((uint32_t)0x00000001) /*!< Counter enable */
#define SysTick_CTRL_TICKINT   ((uint32_t)0x00000002) /*!< Counting down to 0 pends the SysTick handler */
#define SysTick_CTRL_CLKSOURCE ((uint32_t)0x00000004) /*!< Clock source */
#define SysTick_CTRL_COUNTFLAG ((uint32_t)0x00010000) /*!< Count Flag */

/*****************  Bit definition for SysTick_LOAD register  *****************/
#define SysTick_LOAD_RELOAD                                                                                            \
    ((uint32_t)0x00FFFFFF) /*!< Value to load into the SysTick Current Value Register when the counter reaches 0 */

/*****************  Bit definition for SysTick_VAL register  ******************/
#define SysTick_VAL_CURRENT ((uint32_t)0x00FFFFFF) /*!< Current value at the time the register is accessed */

/*****************  Bit definition for SysTick_CALIB register  ****************/
#define SysTick_CALIB_TENMS ((uint32_t)0x00FFFFFF) /*!< Reload value to use for 10ms timing */
#define SysTick_CALIB_SKEW  ((uint32_t)0x40000000) /*!< Calibration value is not exactly 10 ms */
#define SysTick_CALIB_NOREF ((uint32_t)0x80000000) /*!< The reference clock is not provided */

/******************************************************************************/
/*                                                                            */
/*                  Nested Vectored Interrupt Controller                      */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for NVIC_ISER register  *******************/
#define NVIC_ISER_SETENA    ((uint32_t)0xFFFFFFFF) /*!< Interrupt set enable bits */
#define NVIC_ISER_SETENA_0  ((uint32_t)0x00000001) /*!< bit 0 */
#define NVIC_ISER_SETENA_1  ((uint32_t)0x00000002) /*!< bit 1 */
#define NVIC_ISER_SETENA_2  ((uint32_t)0x00000004) /*!< bit 2 */
#define NVIC_ISER_SETENA_3  ((uint32_t)0x00000008) /*!< bit 3 */
#define NVIC_ISER_SETENA_4  ((uint32_t)0x00000010) /*!< bit 4 */
#define NVIC_ISER_SETENA_5  ((uint32_t)0x00000020) /*!< bit 5 */
#define NVIC_ISER_SETENA_6  ((uint32_t)0x00000040) /*!< bit 6 */
#define NVIC_ISER_SETENA_7  ((uint32_t)0x00000080) /*!< bit 7 */
#define NVIC_ISER_SETENA_8  ((uint32_t)0x00000100) /*!< bit 8 */
#define NVIC_ISER_SETENA_9  ((uint32_t)0x00000200) /*!< bit 9 */
#define NVIC_ISER_SETENA_10 ((uint32_t)0x00000400) /*!< bit 10 */
#define NVIC_ISER_SETENA_11 ((uint32_t)0x00000800) /*!< bit 11 */
#define NVIC_ISER_SETENA_12 ((uint32_t)0x00001000) /*!< bit 12 */
#define NVIC_ISER_SETENA_13 ((uint32_t)0x00002000) /*!< bit 13 */
#define NVIC_ISER_SETENA_14 ((uint32_t)0x00004000) /*!< bit 14 */
#define NVIC_ISER_SETENA_15 ((uint32_t)0x00008000) /*!< bit 15 */
#define NVIC_ISER_SETENA_16 ((uint32_t)0x00010000) /*!< bit 16 */
#define NVIC_ISER_SETENA_17 ((uint32_t)0x00020000) /*!< bit 17 */
#define NVIC_ISER_SETENA_18 ((uint32_t)0x00040000) /*!< bit 18 */
#define NVIC_ISER_SETENA_19 ((uint32_t)0x00080000) /*!< bit 19 */
#define NVIC_ISER_SETENA_20 ((uint32_t)0x00100000) /*!< bit 20 */
#define NVIC_ISER_SETENA_21 ((uint32_t)0x00200000) /*!< bit 21 */
#define NVIC_ISER_SETENA_22 ((uint32_t)0x00400000) /*!< bit 22 */
#define NVIC_ISER_SETENA_23 ((uint32_t)0x00800000) /*!< bit 23 */
#define NVIC_ISER_SETENA_24 ((uint32_t)0x01000000) /*!< bit 24 */
#define NVIC_ISER_SETENA_25 ((uint32_t)0x02000000) /*!< bit 25 */
#define NVIC_ISER_SETENA_26 ((uint32_t)0x04000000) /*!< bit 26 */
#define NVIC_ISER_SETENA_27 ((uint32_t)0x08000000) /*!< bit 27 */
#define NVIC_ISER_SETENA_28 ((uint32_t)0x10000000) /*!< bit 28 */
#define NVIC_ISER_SETENA_29 ((uint32_t)0x20000000) /*!< bit 29 */
#define NVIC_ISER_SETENA_30 ((uint32_t)0x40000000) /*!< bit 30 */
#define NVIC_ISER_SETENA_31 ((uint32_t)0x80000000) /*!< bit 31 */

