eboxmaker/eBox_Framework/mcuLib/N32G030/CMSIS/device/n32g030.h
/******************  Bit definition for ADC_SAMPT2 register  *******************/
#define ADC_SAMPT2_SAMP8   ((uint32_t)0x0000000F) /*!< SMP8[3:0] bits (Channel 8 Sample time selection) */
#define ADC_SAMPT2_SAMP8_0 ((uint32_t)0x00000001) /*!< Bit 0 */
#define ADC_SAMPT2_SAMP8_1 ((uint32_t)0x00000002) /*!< Bit 1 */
#define ADC_SAMPT2_SAMP8_2 ((uint32_t)0x00000004) /*!< Bit 2 */
#define ADC_SAMPT2_SAMP8_3 ((uint32_t)0x00000008) /*!< Bit 3 */

#define ADC_SAMPT2_SAMP9   ((uint32_t)0x000000F0) /*!< SMP9[3:0] bits (Channel 9 Sample time selection) */
#define ADC_SAMPT2_SAMP9_0 ((uint32_t)0x00000010) /*!< Bit 0 */
#define ADC_SAMPT2_SAMP9_1 ((uint32_t)0x00000020) /*!< Bit 1 */
#define ADC_SAMPT2_SAMP9_2 ((uint32_t)0x00000040) /*!< Bit 2 */
#define ADC_SAMPT2_SAMP9_3 ((uint32_t)0x00000080) /*!< Bit 3 */

#define ADC_SAMPT2_SAMP10   ((uint32_t)0x00000F00) /*!< SMP10[3:0] bits (Channel 10 Sample time selection) */
#define ADC_SAMPT2_SAMP10_0 ((uint32_t)0x00000100) /*!< Bit 0 */
#define ADC_SAMPT2_SAMP10_1 ((uint32_t)0x00000200) /*!< Bit 1 */
#define ADC_SAMPT2_SAMP10_2 ((uint32_t)0x00000400) /*!< Bit 2 */
#define ADC_SAMPT2_SAMP10_3 ((uint32_t)0x00000800) /*!< Bit 3 */

#define ADC_SAMPT2_SAMP11   ((uint32_t)0x0000F000) /*!< SMP11[3:0] bits (Channel 11 Sample time selection) */
#define ADC_SAMPT2_SAMP11_0 ((uint32_t)0x00001000) /*!< Bit 0 */
#define ADC_SAMPT2_SAMP11_1 ((uint32_t)0x00002000) /*!< Bit 1 */
#define ADC_SAMPT2_SAMP11_2 ((uint32_t)0x00004000) /*!< Bit 2 */
#define ADC_SAMPT2_SAMP11_3 ((uint32_t)0x00008000) /*!< Bit 3 */

#define ADC_SAMPT2_SAMP12   ((uint32_t)0x000F0000) /*!< SMP12[3:0] bits (Channel 12 Sample time selection) */
#define ADC_SAMPT2_SAMP12_0 ((uint32_t)0x00010000) /*!< Bit 0 */
#define ADC_SAMPT2_SAMP12_1 ((uint32_t)0x00020000) /*!< Bit 1 */
#define ADC_SAMPT2_SAMP12_2 ((uint32_t)0x00040000) /*!< Bit 2 */
#define ADC_SAMPT2_SAMP12_3 ((uint32_t)0x00080000) /*!< Bit 3 */

#define ADC_SAMPT2_SAMP13   ((uint32_t)0x00F00000) /*!< SMP13[3:0] bits (Channel 13 Sample time selection) */
#define ADC_SAMPT2_SAMP13_0 ((uint32_t)0x00100000) /*!< Bit 0 */
#define ADC_SAMPT2_SAMP13_1 ((uint32_t)0x00200000) /*!< Bit 1 */
#define ADC_SAMPT2_SAMP13_2 ((uint32_t)0x00400000) /*!< Bit 2 */
#define ADC_SAMPT2_SAMP13_3 ((uint32_t)0x00800000) /*!< Bit 3 */

#define ADC_SAMPT2_SAMP14   ((uint32_t)0x0F000000) /*!< SMP14[3:0] bits (Channel 14 Sample time selection) */
#define ADC_SAMPT2_SAMP14_0 ((uint32_t)0x01000000) /*!< Bit 0 */
#define ADC_SAMPT2_SAMP14_1 ((uint32_t)0x02000000) /*!< Bit 1 */
#define ADC_SAMPT2_SAMP14_2 ((uint32_t)0x04000000) /*!< Bit 2 */
#define ADC_SAMPT2_SAMP14_3 ((uint32_t)0x08000000) /*!< Bit 3 */

#define ADC_SAMPT2_SAMP15   ((uint32_t)0xF0000000) /*!< SMP15[3:0] bits (Channel 15 Sample time selection) */
#define ADC_SAMPT2_SAMP15_0 ((uint32_t)0x10000000) /*!< Bit 0 */
#define ADC_SAMPT2_SAMP15_1 ((uint32_t)0x20000000) /*!< Bit 1 */
#define ADC_SAMPT2_SAMP15_2 ((uint32_t)0x40000000) /*!< Bit 2 */
#define ADC_SAMPT2_SAMP15_3 ((uint32_t)0x80000000) /*!< Bit 3 */

/******************  Bit definition for ADC_SAMPT3 register  *******************/
#define ADC_SAMPT3_SAMP0   ((uint32_t)0x0000000F) /*!< SMP0[3:0] bits (Channel 0 Sample time selection) */
#define ADC_SAMPT3_SAMP0_0 ((uint32_t)0x00000001) /*!< Bit 0 */
#define ADC_SAMPT3_SAMP0_1 ((uint32_t)0x00000002) /*!< Bit 1 */
#define ADC_SAMPT3_SAMP0_2 ((uint32_t)0x00000004) /*!< Bit 2 */
#define ADC_SAMPT3_SAMP0_3 ((uint32_t)0x00000008) /*!< Bit 3 */

#define ADC_SAMPT3_SAMP1   ((uint32_t)0x000000F0) /*!< SMP1[3:0] bits (Channel 1 Sample time selection) */
#define ADC_SAMPT3_SAMP1_0 ((uint32_t)0x00000010) /*!< Bit 0 */
#define ADC_SAMPT3_SAMP1_1 ((uint32_t)0x00000020) /*!< Bit 1 */
#define ADC_SAMPT3_SAMP1_2 ((uint32_t)0x00000040) /*!< Bit 2 */
#define ADC_SAMPT3_SAMP1_3 ((uint32_t)0x00000080) /*!< Bit 3 */

#define ADC_SAMPT3_SAMP2   ((uint32_t)0x00000F00) /*!< SMP2[3:0] bits (Channel 2 Sample time selection) */
#define ADC_SAMPT3_SAMP2_0 ((uint32_t)0x00000100) /*!< Bit 0 */
#define ADC_SAMPT3_SAMP2_1 ((uint32_t)0x00000200) /*!< Bit 1 */
#define ADC_SAMPT3_SAMP2_2 ((uint32_t)0x00000400) /*!< Bit 2 */
#define ADC_SAMPT3_SAMP2_3 ((uint32_t)0x00000800) /*!< Bit 3 */

#define ADC_SAMPT3_SAMP3   ((uint32_t)0x0000F000) /*!< SMP3[3:0] bits (Channel 3 Sample time selection) */
#define ADC_SAMPT3_SAMP3_0 ((uint32_t)0x00001000) /*!< Bit 0 */
#define ADC_SAMPT3_SAMP3_1 ((uint32_t)0x00002000) /*!< Bit 1 */
#define ADC_SAMPT3_SAMP3_2 ((uint32_t)0x00004000) /*!< Bit 2 */
#define ADC_SAMPT3_SAMP3_3 ((uint32_t)0x00008000) /*!< Bit 3 */

#define ADC_SAMPT3_SAMP4   ((uint32_t)0x000F0000) /*!< SMP4[3:0] bits (Channel 4 Sample time selection) */
#define ADC_SAMPT3_SAMP4_0 ((uint32_t)0x00010000) /*!< Bit 0 */
#define ADC_SAMPT3_SAMP4_1 ((uint32_t)0x00020000) /*!< Bit 1 */
#define ADC_SAMPT3_SAMP4_2 ((uint32_t)0x00040000) /*!< Bit 2 */
#define ADC_SAMPT3_SAMP4_3 ((uint32_t)0x00080000) /*!< Bit 3 */

#define ADC_SAMPT3_SAMP5   ((uint32_t)0x00F00000) /*!< SMP5[3:0] bits (Channel 5 Sample time selection) */
#define ADC_SAMPT3_SAMP5_0 ((uint32_t)0x00100000) /*!< Bit 0 */
#define ADC_SAMPT3_SAMP5_1 ((uint32_t)0x00200000) /*!< Bit 1 */
#define ADC_SAMPT3_SAMP5_2 ((uint32_t)0x00400000) /*!< Bit 2 */
#define ADC_SAMPT3_SAMP5_3 ((uint32_t)0x00800000) /*!< Bit 3 */

#define ADC_SAMPT3_SAMP6   ((uint32_t)0x0F000000) /*!< SMP6[3:0] bits (Channel 6 Sample time selection) */
#define ADC_SAMPT3_SAMP6_0 ((uint32_t)0x01000000) /*!< Bit 0 */
#define ADC_SAMPT3_SAMP6_1 ((uint32_t)0x02000000) /*!< Bit 1 */
#define ADC_SAMPT3_SAMP6_2 ((uint32_t)0x04000000) /*!< Bit 2 */
#define ADC_SAMPT3_SAMP6_3 ((uint32_t)0x08000000) /*!< Bit 3 */

#define ADC_SAMPT3_SAMP7   ((uint32_t)0xF0000000) /*!< SMP7[3:0] bits (Channel 7 Sample time selection) */
#define ADC_SAMPT3_SAMP7_0 ((uint32_t)0x10000000) /*!< Bit 0 */
#define ADC_SAMPT3_SAMP7_1 ((uint32_t)0x20000000) /*!< Bit 1 */
#define ADC_SAMPT3_SAMP7_2 ((uint32_t)0x40000000) /*!< Bit 2 */
#define ADC_SAMPT3_SAMP7_3 ((uint32_t)0x80000000) /*!< Bit 3 */

